"""
Скласти підпрограму та програму для обчислення значення натурального числа за заданим рядком символів,
який є записом цього числа у системі числення за основою b(2<b<16).
Використати функцію, яка за заданим символом повертає відповідну цифру у системі числення за основою b.
Використати у цій функції твердження про стан програми assert для перевірки того, що відповідний
символ є цифрою у системі числення за основою b.
Обробити у підпрограмі помилку неправильного символу рядка та показати змістовне повідомлення про помилку.
"""


def f1(symbol, b):
    s = "0123456789ABCDEF"
    numeric = s.find(symbol)
    assert 0 <= numeric < b, f"{symbol} не належить системі числення за основою {b}"
    return numeric


def f2(number, b):
    try:
        final_number = 0
        while len(number) > 0:
            final_number = final_number * b + f1(number[0], b)
            number = number[1:]
    except AssertionError:
        return "Число містить цифру, яка не існує в даній системі числення"
    else:
        return final_number


b0 = int(input("Введіть основу системи числення: "))
number0 = input("Введіть число: ")
print(f2(number0, b0))
